; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v7 ?v4)
             (pred_12 ?v3 ?v5)
             (pred_7 ?v7 ?v5)
             (pred_4 ?v1 ?v7 )
	     (pred_3 ?v7)
             (pred_8 ?v12)
             (pred_11 ?v3)
             (pred_2 ?v5)
             (pred_9 ?v7)
             (pred_10 ?v3)
             (pred_1 ?v7)
             (pred_5 ))



(:action op_5
:parameters (?v9 ?v8 ?v13 ?v11)
:precondition (and (pred_8 ?v9) (pred_8 ?v8) (pred_11 ?v13) (pred_2 ?v11)
          (pred_6 ?v9 ?v8) (pred_12 ?v13 ?v11)
                   (pred_7 ?v8 ?v11) (pred_3 ?v9) 
                   (pred_9 ?v8) (pred_10 ?v13))
:effect (and  (pred_1 ?v8) (not (pred_9 ?v8))))


(:action op_3
:parameters (?v9 ?v2)
:precondition (and (pred_8 ?v9) (pred_8 ?v2)
               (pred_3 ?v9) (pred_6 ?v9 ?v2) (pred_1 ?v2))
:effect (and (pred_3 ?v2) (not (pred_3 ?v9))))

(:action op_2
:parameters (?v9 ?v13)
:precondition (and (pred_8 ?v9) (pred_11 ?v13) 
                  (pred_3 ?v9) (pred_4 ?v13 ?v9) (pred_5 ))
:effect (and (pred_10 ?v13)
   (not (pred_4 ?v13 ?v9)) (not (pred_5 ))))


(:action op_4
:parameters (?v9 ?v6 ?v10)
:precondition (and (pred_8 ?v9) (pred_11 ?v6) (pred_11 ?v10)
                  (pred_3 ?v9) (pred_10 ?v10) (pred_4 ?v6 ?v9))
:effect (and (pred_10 ?v6) (pred_4 ?v10 ?v9)
        (not (pred_10 ?v10)) (not (pred_4 ?v6 ?v9))))

(:action op_1
:parameters (?v9 ?v13)
:precondition (and (pred_8 ?v9) (pred_11 ?v13) 
                  (pred_3 ?v9) (pred_10 ?v13))
:effect (and (pred_5 ) (pred_4 ?v13 ?v9) (not (pred_10 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_15 obj_24 obj_28 obj_17 obj_05 obj_27 obj_01 obj_02 obj_07 obj_14 obj_18 obj_13 obj_29 obj_21 obj_20 obj_16 obj_12 obj_10 obj_26 obj_06 obj_25 obj_03 obj_23 obj_04
    obj_11 obj_30
    obj_09 obj_19 obj_08
    )

    (:init
       (pred_5)

       (pred_8 obj_22)
       (pred_8 obj_15)
       (pred_8 obj_24)
       (pred_8 obj_28)
       (pred_8 obj_17)
       (pred_8 obj_05)
       (pred_8 obj_27)
       (pred_8 obj_01)
       (pred_8 obj_02)
       (pred_8 obj_07)
       (pred_8 obj_14)
       (pred_8 obj_18)
       (pred_8 obj_13)
       (pred_8 obj_29)
       (pred_8 obj_21)
       (pred_8 obj_20)
       (pred_8 obj_16)
       (pred_8 obj_12)
       (pred_8 obj_10)
       (pred_8 obj_26)
       (pred_8 obj_06)
       (pred_8 obj_25)
       (pred_8 obj_03)
       (pred_8 obj_23)
       (pred_8 obj_04)
       (pred_2 obj_11)
       (pred_2 obj_30)
       (pred_11 obj_09)
       (pred_11 obj_19)
       (pred_11 obj_08)

       (pred_6 obj_22 obj_05)
       (pred_6 obj_22 obj_15)
       (pred_6 obj_15 obj_27)
       (pred_6 obj_15 obj_24)
       (pred_6 obj_15 obj_22)
       (pred_6 obj_24 obj_01)
       (pred_6 obj_24 obj_28)
       (pred_6 obj_24 obj_15)
       (pred_6 obj_28 obj_02)
       (pred_6 obj_28 obj_17)
       (pred_6 obj_28 obj_24)
       (pred_6 obj_17 obj_07)
       (pred_6 obj_17 obj_28)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_05 obj_27)
       (pred_6 obj_05 obj_22)
       (pred_6 obj_27 obj_18)
       (pred_6 obj_27 obj_01)
       (pred_6 obj_27 obj_15)
       (pred_6 obj_27 obj_05)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_01 obj_02)
       (pred_6 obj_01 obj_24)
       (pred_6 obj_01 obj_27)
       (pred_6 obj_02 obj_29)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_02 obj_28)
       (pred_6 obj_02 obj_01)
       (pred_6 obj_07 obj_21)
       (pred_6 obj_07 obj_17)
       (pred_6 obj_07 obj_02)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_14 obj_18)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_18 obj_27)
       (pred_6 obj_18 obj_14)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_29)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_29 obj_10)
       (pred_6 obj_29 obj_21)
       (pred_6 obj_29 obj_02)
       (pred_6 obj_29 obj_13)
       (pred_6 obj_21 obj_26)
       (pred_6 obj_21 obj_07)
       (pred_6 obj_21 obj_29)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_20 obj_16)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_16 obj_25)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_16 obj_20)
       (pred_6 obj_12 obj_03)
       (pred_6 obj_12 obj_10)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_12 obj_16)
       (pred_6 obj_10 obj_23)
       (pred_6 obj_10 obj_26)
       (pred_6 obj_10 obj_29)
       (pred_6 obj_10 obj_12)
       (pred_6 obj_26 obj_04)
       (pred_6 obj_26 obj_21)
       (pred_6 obj_26 obj_10)
       (pred_6 obj_06 obj_25)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_25 obj_03)
       (pred_6 obj_25 obj_16)
       (pred_6 obj_25 obj_06)
       (pred_6 obj_03 obj_23)
       (pred_6 obj_03 obj_12)
       (pred_6 obj_03 obj_25)
       (pred_6 obj_23 obj_04)
       (pred_6 obj_23 obj_10)
       (pred_6 obj_23 obj_03)
       (pred_6 obj_04 obj_26)
       (pred_6 obj_04 obj_23)
       (pred_9 obj_03)
       (pred_9 obj_27)
       (pred_9 obj_12)
       (pred_7  obj_03 obj_11)
       (pred_7  obj_27 obj_30)
       (pred_7  obj_12 obj_30)
       (pred_1 obj_22)
       (pred_1 obj_15)
       (pred_1 obj_24)
       (pred_1 obj_28)
       (pred_1 obj_17)
       (pred_1 obj_05)
       (pred_1 obj_01)
       (pred_1 obj_02)
       (pred_1 obj_07)
       (pred_1 obj_14)
       (pred_1 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_29)
       (pred_1 obj_21)
       (pred_1 obj_20)
       (pred_1 obj_16)
       (pred_1 obj_10)
       (pred_1 obj_26)
       (pred_1 obj_06)
       (pred_1 obj_25)
       (pred_1 obj_23)
       (pred_1 obj_04)

       (pred_12  obj_09 obj_11)
       (pred_12  obj_19 obj_30)
       (pred_12  obj_08 obj_30)
       (pred_4 obj_09 obj_26)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_08 obj_29)
       (pred_3 obj_06)
    )

    (:goal (and
       (pred_4 obj_19 obj_01)
       (pred_4 obj_08 obj_26)
    ))
(:constraints
  (always (not (pred_3 obj_13)))
)
)

; plan
1. (op_3 obj_06 obj_25)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_25)
   goals met: 0 of 2
2. (op_3 obj_25 obj_16)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_16)
   goals met: 0 of 2
3. (op_2 obj_16 obj_19)
   deleted: (pred_4 obj_19 obj_16) (pred_5)
   added: (pred_10 obj_19)
   goals met: 0 of 2
4. (op_3 obj_16 obj_18)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_18)
   goals met: 0 of 2
5. (op_5 obj_18 obj_27 obj_19 obj_30)
   deleted: (pred_9 obj_27)
   added: (pred_1 obj_27)
   goals met: 0 of 2
6. (op_3 obj_18 obj_27)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_27)
   goals met: 0 of 2
7. (op_3 obj_27 obj_01)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_01)
   goals met: 0 of 2
8. (op_1 obj_01 obj_19)
   deleted: (pred_10 obj_19)
   added: (pred_5) (pred_4 obj_19 obj_01)
   goals met: 1 of 2
9. (op_3 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_02)
   goals met: 1 of 2
10. (op_3 obj_02 obj_29)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_29)
   goals met: 1 of 2
11. (op_2 obj_29 obj_08)
   deleted: (pred_4 obj_08 obj_29) (pred_5)
   added: (pred_10 obj_08)
   goals met: 1 of 2
12. (op_3 obj_29 obj_21)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_21)
   goals met: 1 of 2
13. (op_3 obj_21 obj_26)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_26)
   goals met: 1 of 2
14. (op_4 obj_26 obj_09 obj_08)
   deleted: (pred_10 obj_08) (pred_4 obj_09 obj_26)
   added: (pred_10 obj_09) (pred_4 obj_08 obj_26)
   goals met: 2 of 2
